In [21]:
import pandas as pd

import psycopg2
from sqlalchemy import create_engine

Step-1 Data Cleaning and Visualization

In [5]:
df = pd.read_csv('Mobile_Sales_Data.csv', encoding_errors='ignore')

In [6]:
df.head()

,Transaction ID,Day Name,Brand,Units Sold,Price Per Unit,Customer Name,Customer Age,City,Payment Method,Customer Ratings,Mobile Model,Date
0,1,Sat,Xiaomi,6,10174.70,Lalita Ahuja,38,Ludhiana,UPI,5,Redmi Note 10,10/9/2021
1,2,Saturday,Vivo,6,10565.19,Sneha Sharma,37,Delhi,Credit Card,3,Vivo Y51,10/9/2021
2,3,Saturday,Vivo,8,58527.58,Radha Srivastava,40,Mumbai,UPI,5,Vivo S1,10/9/2021
3,4,Sunday,Xiaomi,5,25563.98,Bhavana Arora,21,Mumbai,Credit Card,4,Mi 11,10/10/2021
4,5,Sunday,OnePlus,3,48168.02,Sneha Mehta,38,Gorakhpur,Cash,5,OnePlus 9,10/10/2021

In [7]:
df.describe()

,Transaction ID,Units Sold,Price Per Unit,Customer Age,Customer Ratings
count,3835.000000,3835.000000,3835.000000,3835.000000,3835.000000
mean,1918.000000,4.993481,40114.036816,38.098305,3.693090
std,1107.213469,2.581122,17310.488427,12.110622,1.325069
min,1.000000,1.000000,10011.110000,18.000000,1.000000
25%,959.500000,3.000000,25617.405000,27.500000,3.000000
50%,1918.000000,5.000000,40136.490000,38.000000,4.000000
75%,2876.500000,7.000000,54973.475000,49.000000,5.000000
max,3835.000000,9.000000,69984.480000,59.000000,5.000000

In [8]:
df.isnull().sum()

Transaction ID      0
Day Name            0
Brand               0
Units Sold          0
Price Per Unit      0
Customer Name       0
Customer Age        0
City                0
Payment Method      0
Customer Ratings    0
Mobile Model        0
Date                0
dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3835 entries, 0 to 3834
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    3835 non-null   int64
 1   Day Name          3835 non-null   object
 2   Brand             3835 non-null   object
 3   Units Sold        3835 non-null   int64
 4   Price Per Unit    3835 non-null   float64
 5   Customer Name     3835 non-null   object
 6   Customer Age      3835 non-null   int64
 7   City              3835 non-null   object
 8   Payment Method    3835 non-null   object
 9   Customer Ratings  3835 non-null   int64
 10  Mobile Model      3835 non-null   object
 11  Date              3835 non-null   object
dtypes: float64(1), int64(4), object(7)
memory usage: 359.7+ KB

In [12]:
df.duplicated().sum()

np.int64(0)

In [13]:
df.columns = df.columns.str.lower()

In [14]:
df.columns

Index(['transaction id', 'day name', 'brand', 'units sold', 'price per unit',
       'customer name', 'customer age', 'city', 'payment method',
       'customer ratings', 'mobile model', 'date'],
      dtype='object')

In [35]:
df['total'] = df['units sold'] * df['price per unit']
df.head()

,transaction id,day name,brand,units sold,price per unit,customer name,customer age,city,payment method,customer ratings,mobile model,date,total
0,1,Sat,Xiaomi,6,10174.70,Lalita Ahuja,38,Ludhiana,UPI,5,Redmi Note 10,10/9/2021,61048.20
1,2,Saturday,Vivo,6,10565.19,Sneha Sharma,37,Delhi,Credit Card,3,Vivo Y51,10/9/2021,63391.14
2,3,Saturday,Vivo,8,58527.58,Radha Srivastava,40,Mumbai,UPI,5,Vivo S1,10/9/2021,468220.64
3,4,Sunday,Xiaomi,5,25563.98,Bhavana Arora,21,Mumbai,Credit Card,4,Mi 11,10/10/2021,127819.90
4,5,Sunday,OnePlus,3,48168.02,Sneha Mehta,38,Gorakhpur,Cash,5,OnePlus 9,10/10/2021,144504.06

In [36]:
df.to_csv('Mobile_Sales_Clean_Data.csv', index=False)

Step-2 Data Load in Sql

In [37]:
#psql connection
# "psql+pymysql://user:password@localhost:3306/db_name"
engine_psql = create_engine("postgresql+psycopg2://postgres:6835@localhost:5432/mobile_sales_db")

try:
    engine_psql
    print("Connection Successed to PSQL")
except:
    print("Unable to connect")

Connection Successed to PSQL

In [38]:
df.to_sql(name='mobile', con=engine_psql, if_exists='replace', index=False)

835